Repository: kklobe/normalize
Catalog: po/*.po
Languages: fr

source: %s: I don't know what to do with %d bytes per sample
fr: %s: Je ne sais pas quoi faire avec des octets de %d par échantillon

source: %s: afNewFileSetup failed
fr: %s: afNewFileSetup a échoué

source: %s: afOpenFD failed
fr: %s: afOpenFD a échoué

source: %s: Warning: no lookup table available; this may be slow...
fr: %s: Avertissement: aucune table de consultation n'est disponible; ceci sera lent...

source: %s: afWriteFrames failed
fr: %s: afWriteFrames a échoué

source: %s: %d clippings performed, %.4f%% loss
fr: %s: %d coupures ont été exécutées, détruit %.4f%%

source: %s: Warning: lost %0.2f%% of data due to clipping
fr: %s: Avertissement: détruit %0.2f%% des données dues au découpage

source: %s: afSyncFile failed
fr: %s: afSyncFile a échoué

source: Applying adjustment of %0.2fdB to %s...
fr: J'applique un réglage de %0.2fdB à %s

source: %s: error opening %s: %s
fr: %s: il y avait une erreur tout en ouvrant %s: %s

source: %s: error opening temp file: %s
fr: %s: il y avait une erreur tout en lisant le fichier temporaire: %s

source: %s: error moving %s to %s: %s
fr: %s: il y avait une erreur tandis qu'en mouvement %s à %s: %s

source: %s: option `%s' is ambiguous
fr: %s: l'option `%s' est ambigu

source: %s: option `--%s' doesn't allow an argument
fr: %s: l'option `--%s' ne permet pas de paramètre

source: %s: option `%c%s' doesn't allow an argument
fr: %s: l'option `%c%s' ne permet pas de paramètre

source: %s: option `%s' requires an argument
fr: %s: l'option `--%s' requiert un paramètre

source: %s: unrecognized option `--%s'
fr: %s: l'option `--%s' n'est pas reconnue.

source: %s: unrecognized option `%c%s'
fr: %s: l'option `%c%s' n'est pas reconnue.

source: %s: illegal option -- %c
fr: %s: l'option -- %c est illégale.

source: %s: invalid option -- %c
fr: %s: l'option -- %c est invalide.

source: %s: option requires an argument -- %c
fr: %s: l'option -- %c requiert un paramètre

source: %s: option `-W %s' is ambiguous
fr: %s: l'option `-W %s' est ambigu

source: %s: option `-W %s' doesn't allow an argument
fr: %s: l'option `-W %s' ne permet pas de paramètre

source: %s: error reading ID3 tag
fr: %s: il y avait une erreur tout en lisant l'étiquette ID3

source: %s: error converting tag
fr: %s: il y avait une erreur tout en convertissant l'étiquette ID3

source: %s: error writing ID3 tag
fr: %s: il y avait une erreur tout en écrivant l'étiquette ID3

source: %s: mad error 0x%04x
fr: %s: mad erreur 0x%04x

source: %s: unrecoverable mad error 0x%04x
fr: %s: irrémédiable mad erreur 0x%04x

source: Usage: %s [OPTION]... [FILE]...
fr: Utilisation: %s [OPTION]... [FICHIER]...

source: Try `%s --help' for more information.
fr: Essayez `%s --help' pour plus d'information

source: Usage: %s [OPTION]... [FILE]... Normalize volume of multiple audio files -a, --amplitude=AMP normalize the volume to the target amplitude AMP [default -12dBFS] -b, --batch batch mode: get average of all levels, and use one adjustment, based on the average level, for all files --clipping turn off limiter; do clipping instead --fractions display levels as fractions of maximum amplitude instead of decibels -g, --gain=ADJ don't compute levels, just apply adjustment ADJ to the files. Use the suffix "dB" to indicate a gain in decibels. -l, --limiter=LEV limit all samples above LEV [default -6dBFS] -m, --mix mix mode: get average of all levels, and normalize volume of each file to the average -n, --no-adjust compute and display the volume adjustment, but don't apply it to any of the files --peak adjust by peak level instead of using loudness analysis -q, --quiet quiet (decrease verbosity to zero) -t, --average-threshold=T when computing average level, ignore any levels more than T decibels from average -T, --adjust-threshold=T don't bother applying any adjustment smaller than T decibels -v, --verbose increase verbosity -w, --output-bitwidth=W force adjusted files to have W-bit samples -V, --version display version information and exit -h, --help display this help and exit Report bugs to <chrisvaill@gmail.com>.
fr: Utilisation: %s normalize [OPTION]... [FICHIER]... Normaliser le volume de fichiers sonores multiples -a, --amplitude=AMP normaliser le volume à l'amplitude AMP [-12dBFS par défaut] -b, --batch batch mode: faire la moyenne des niveaux de tous les fichiers donnés sur la ligne de commande, et utiliser un réglage, basé sur le niveau moyen, pour tous les fichiers --clipping faire le découpage au lieu de la limitation --fractions afficher les niveaux comme fractions au lieu de comme des décibels -g, --gain=ADJ ne pas calculer de réglage de volume, et appliquer le réglage ADJ aux fichiers. Employer le suffixe "dB" pour indiquer que le réglage est en décibels. -l, --limiter=LEV limiter tous les échantillons au-dessus du niveau LEV [-6dBFS par défaut] -m, --mix mix mode: Faire la moyenne des niveaux de tous les fichiers donnés sur la ligne de commande, et normaliser le volume de chaque fichier au niveau moyen -n, --no-adjust calculer et afficher le réglage de volume sans l'appliquer --peak ajuster en utilisant les niveaux maximum au lieu des niveaux RMS -q, --quiet quiet (supprimer verbosité) -t, --average-threshold=T quand le niveau moyen est être calculé, ne pas tenir compte des valeurs dont la différence avec la moyenne est supérieure à T décibels. Par défaut, utilise deux fois l'écart type de tous les niveaux -T, --adjust-threshold=T ne pas prendre la peine d'appliquer tout réglage plus petit que des décibels de T -v, --verbose augmenter le verbosité -w, --output-bitwidth=W forcer a ajusté des fichiers pour avoir des échantillons avec une largeur de W bits -V, --version afficher le nom et la version du logiciel -h, --help afficher cette aide et quitter Rapporter toutes anomalies à <chrisvaill@gmail.com>.

source: %s: normalizing to %f dBFS
fr: %s: Je normalise à %f dBFS

source: %s: error: bad target amplitude %f
fr: %s: erreur: l'amplitude %f est invalide

source: %s: invalid argument to -g option
fr: %s: le paramètre au l'option -g est invalide

source: %s: Warning: the -c option is deprecated, and may be removed in v1.0
fr: %s: Avertissement: l'option `-c' est désapprouvée

source: Copyright (C) 2005 Chris Vaill This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
fr: Copyright (C) 2005 Chris Vaill Ce logiciel est libre; voir les sources pour les conditions de reproduction. AUCUNE garantie n'est donnée; tant pour des raisons COMMERCIALES que pour RÉPONDRE À UN BESOIN PARTICULIER.

source: This copy of normalize is compiled with the following libraries:
fr: Cette copie de normalize est compilée avec les bibliothèques suivantes:

source: %s: error: output bitwidth must be between 1 and 32
fr: %s: erreur: la largeur d'échantillon de sortie doit être entre 1 et 32

source: %s: error: the -m and -b options are mutually exclusive
fr: %s: erreur: -m et -b sont mutuellement exclusif

source: %s: error: -m and -b can't be used with the --peak option
fr: %s: erreur: -m et -b ne peut pas être utilisé avec --peak

source: %s: Warning: stdin specified on command line, not adjusting files
fr: %s: Avertissement: stdin indiqué, n'appliquant pas le réglage

source: %s: file %s: %s
fr: %s: fichier %s: %s

source: %s: no files!
fr: %s: aucuns fichiers!

source: %-12.6f average level
fr: %-12.6f moyen niveau

source: %-12s average level
fr: %-12s moyen niveau

source: Average level: %0.4f
fr: Moyen niveau: %0.4f

source: Average level: %0.4fdBFS
fr: Moyen niveau: %0.4fdBFS

source: Files are already normalized, not adjusting...
fr: Des fichiers sont déjà normalisés, ne s'ajustant pas...

source: Applying adjustment of %fdB...
fr: J'applique un réglage de %fdB...

source: Applying adjustment of %f...
fr: J'applique un réglage de %f...

source: Applying adjustment of %0.2fdB...
fr: J'applique un réglage de %0.2fdB...

source: %s: error applying adjustment to %s: %s
fr: %s: il y avait une erreur tout en appliquant le réglage au %s: %s

source: %s already normalized, not adjusting...
fr: %s déjà normalisé, ne s'ajustant pas...

source: %-12f volume adjustment
fr: %-12f réglage de volume

source: %-12s volume adjustment
fr: %-12s réglage de volume

source: Computing levels...
fr: Je calcule des niveaux...

source: level peak
fr: niveau maximum

source: level peak gain
fr: niveau maximum réglage

source: %s: error reading %s
fr: %s: il y avait une erreur tout en lisant %s

source: File %s has zero power, ignoring...
fr: Le fichier %s a la puissance nulle, je l'ignore...

source: Level for %s: %0.4f (%0.4f peak)
fr: Niveau pour %s: %0.4f (%0.4f maximum)

source: Level for %s: %0.4fdBFS (%0.4fdBFS peak)
fr: Niveau pour %s: %0.4fdBFS (%0.4fdBFS maximum)

source: Standard deviation is %0.2f dB
fr: L'écart type est %0.2f dB

source: Throwing out level of %0.4f (different by %0.2fdB)
fr: Je jette de niveau %0.4f (différent par %0.2fdB)

source: Throwing out level of %0.4fdBFS (different by %0.2fdB)
fr: Je jette de niveau %0.4fdBFS (différent par %0.2fdB)

source: %s: all files ignored, try using -t 100
fr: %s: tous les fichiers ont été ignorés, essayez d'utiliser -t 100

source: %-17s --%% done, ETA --:--:-- (batch --%% done, ETA --:--:--)
fr: %-17s --%% effectué, ETA --:--:-- (batch --%%, ETA --:--:--)

source: %-17s --%% done, ETA --:--:-- (batch %3.0f%% done, ETA %02d:%02d:%02d)
fr: %-17s --%% effectué, ETA --:--:-- (batch %3.0f%%, ETA %02d:%02d:%02d)

source: %-17s %3.0f%% done, ETA %02d:%02d:%02d (batch %3.0f%% done, ETA %02d:%02d:%02d)
fr: %-17s %3.0f%% effectué, ETA %02d:%02d:%02d (batch %3.0f%%, ETA %02d:%02d:%02d)

source: %s: unable to malloc
fr: %s: mémoire virtuelle épuisée

source: %s: error opening WAV file: %s
fr: %s: il y avait une erreur tout en ouvrant fichier WAV: %s

source: %s: error writing: %s
fr: %s: il y avait une erreur tout en écrivant: %s

source: %s: error searching for WAV header: %s
fr: %s: il y avait une erreur tout en recherchant l'en-tête WAV: %s

source: %s: WAV header not found
fr: %s: l'en-tête WAV n'a pas été trouvé

source: %s: this is not a PCM WAV file
fr: %s: ce n'est pas un fichier WAV du PCM

source: %s: more than 32 bits per sample not implemented
fr: %s: plus de 32 bits par échantillon non mis en application

source: %s: error searching for WAV data: %s
fr: %s: il y avait une erreur tout en recherchant les données WAV: %s

source: %s: WAV data not found
fr: %s: des données WAV n'ont pas été trouvées
